MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX360F256L.PIC
      <edc:SFRDef edc:_addr="0x1F8861A0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00868_YPAA_Ports.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn--nnnn" edc:cname="LATG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxx--xxxx--xxxx" edc:name="LATG" edc:nzwidth="0x20" edc:por="----------------xxxx--xxxx--xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATG6" edc:desc="" edc:mask="0x1" edc:name="LATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG7" edc:desc="" edc:mask="0x1" edc:name="LATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG8" edc:desc="" edc:mask="0x1" edc:name="LATG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG9" edc:desc="" edc:mask="0x1" edc:name="LATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATG12" edc:desc="" edc:mask="0x1" edc:name="LATG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG13" edc:desc="" edc:mask="0x1" edc:name="LATG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATG14" edc:desc="" edc:mask="0x1" edc:name="LATG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATG15" edc:desc="" edc:mask="0x1" edc:name="LATG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861B0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00868_YPAA_Ports.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn--nnnn" edc:cname="ODCG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3cf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000--0000--0000" edc:name="ODCG" edc:nzwidth="0x20" edc:por="----------------0000--0000--0000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCG0" edc:desc="" edc:mask="0x1" edc:name="ODCG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG1" edc:desc="" edc:mask="0x1" edc:name="ODCG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG2" edc:desc="" edc:mask="0x1" edc:name="ODCG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG3" edc:desc="" edc:mask="0x1" edc:name="ODCG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG6" edc:desc="" edc:mask="0x1" edc:name="ODCG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG7" edc:desc="" edc:mask="0x1" edc:name="ODCG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG8" edc:desc="" edc:mask="0x1" edc:name="ODCG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG9" edc:desc="" edc:mask="0x1" edc:name="ODCG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCG12" edc:desc="" edc:mask="0x1" edc:name="ODCG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG13" edc:desc="" edc:mask="0x1" edc:name="ODCG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCG14" edc:desc="" edc:mask="0x1" edc:name="ODCG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCG15" edc:desc="" edc:mask="0x1" edc:name="ODCG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861C0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00868_YPAA_Ports.Module" edc:_refcount="7" edc:access="----------------n-n-------------" edc:cname="CNCON" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNCON" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861D0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00868_YPAA_Ports.Module" edc:_refcount="7" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNEN" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNEN" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNEN0" edc:desc="" edc:mask="0x1" edc:name="CNEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN1" edc:desc="" edc:mask="0x1" edc:name="CNEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN2" edc:desc="" edc:mask="0x1" edc:name="CNEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN3" edc:desc="" edc:mask="0x1" edc:name="CNEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN4" edc:desc="" edc:mask="0x1" edc:name="CNEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN5" edc:desc="" edc:mask="0x1" edc:name="CNEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN6" edc:desc="" edc:mask="0x1" edc:name="CNEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN7" edc:desc="" edc:mask="0x1" edc:name="CNEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN8" edc:desc="" edc:mask="0x1" edc:name="CNEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN9" edc:desc="" edc:mask="0x1" edc:name="CNEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN10" edc:desc="" edc:mask="0x1" edc:name="CNEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN11" edc:desc="" edc:mask="0x1" edc:name="CNEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN12" edc:desc="" edc:mask="0x1" edc:name="CNEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN13" edc:desc="" edc:mask="0x1" edc:name="CNEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN14" edc:desc="" edc:mask="0x1" edc:name="CNEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN15" edc:desc="" edc:mask="0x1" edc:name="CNEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN16" edc:desc="" edc:mask="0x1" edc:name="CNEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN17" edc:desc="" edc:mask="0x1" edc:name="CNEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN18" edc:desc="" edc:mask="0x1" edc:name="CNEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN19" edc:desc="" edc:mask="0x1" edc:name="CNEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN20" edc:desc="" edc:mask="0x1" edc:name="CNEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNEN21" edc:desc="" edc:mask="0x1" edc:name="CNEN21" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8861E0" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00868_YPAA_Ports.Module" edc:_refcount="7" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTG" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE2" edc:desc="" edc:mask="0x1" edc:name="CNPUE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE3" edc:desc="" edc:mask="0x1" edc:name="CNPUE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE4" edc:desc="" edc:mask="0x1" edc:name="CNPUE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE5" edc:desc="" edc:mask="0x1" edc:name="CNPUE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE6" edc:desc="" edc:mask="0x1" edc:name="CNPUE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE7" edc:desc="" edc:mask="0x1" edc:name="CNPUE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE10" edc:desc="" edc:mask="0x1" edc:name="CNPUE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE11" edc:desc="" edc:mask="0x1" edc:name="CNPUE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE12" edc:desc="" edc:mask="0x1" edc:name="CNPUE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE13" edc:desc="" edc:mask="0x1" edc:name="CNPUE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE14" edc:desc="" edc:mask="0x1" edc:name="CNPUE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE15" edc:desc="" edc:mask="0x1" edc:name="CNPUE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE16" edc:desc="" edc:mask="0x1" edc:name="CNPUE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE17" edc:desc="" edc:mask="0x1" edc:name="CNPUE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE18" edc:desc="" edc:mask="0x1" edc:name="CNPUE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE19" edc:desc="" edc:mask="0x1" edc:name="CNPUE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE20" edc:desc="" edc:mask="0x1" edc:name="CNPUE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE21" edc:desc="" edc:mask="0x1" edc:name="CNPUE21" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f889000" edc:endaddr="0x1f88a000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph3"/>
    <edc:SFRDataSector edc:beginaddr="0x1f88b000" edc:endaddr="0x1f88d000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph4"/>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="none">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RG15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="PMD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="PMD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="T2CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="T3CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="T4CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="T5CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="SCK2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="CN9"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="SDI2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="CN10"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="SDO2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="SS2"/>
      <edc:VirtualPin edc:name="PMA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RE8"/>
      <edc:VirtualPin edc:name="INT1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RE9"/>
      <edc:VirtualPin edc:name="INT2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="C1IN+"/>
      <edc:VirtualPin edc:name="AN5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="C1IN-"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="C2IN+"/>
      <edc:VirtualPin edc:name="AN3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="C2IN-"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="OCFA"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RA9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="AN9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
      <edc:VirtualPin edc:name="AN10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="AN11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="U2RTS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="U2CTS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="PMALH"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="PMALL"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="CN20"/>
      <edc:VirtualPin edc:name="U1CTS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="U1RTS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="U2RX"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="U2TX"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="U1TX"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="U1RX"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="SDO1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RF7"/>
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RF6"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="SDA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="SCL1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="INT3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="INT4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RD8"/>
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="IC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="IC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="IC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="OC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
